eksperimen/VM 2 Load Tester/logs/combo_ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   266.837 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    37.48 [#/sec] (mean)
Time per request:       2668.370 [ms] (mean)
Time per request:       26.684 [ms] (mean, across all concurrent requests)
Transfer rate:          6.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0      28
Processing:    98 2654 157.2   2664    2841
Waiting:       94 2654 157.2   2664    2841
Total:        101 2654 156.9   2664    2841

Percentage of the requests served within a certain time (ms)
  50%   2664
  66%   2681
  75%   2693
  80%   2702
  90%   2724
  95%   2743
  98%   2763
  99%   2776
 100%   2841 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   266.257 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    37.56 [#/sec] (mean)
Time per request:       2662.574 [ms] (mean)
Time per request:       26.626 [ms] (mean, across all concurrent requests)
Transfer rate:          6.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0      36
Processing:   100 2648 157.4   2659    2857
Waiting:       95 2648 157.4   2659    2851
Total:        100 2649 157.1   2660    2857

Percentage of the requests served within a certain time (ms)
  50%   2660
  66%   2679
  75%   2693
  80%   2701
  90%   2720
  95%   2737
  98%   2757
  99%   2775
 100%   2857 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   263.550 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    37.94 [#/sec] (mean)
Time per request:       2635.497 [ms] (mean)
Time per request:       26.355 [ms] (mean, across all concurrent requests)
Transfer rate:          6.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0      61
Processing:    80 2621 161.4   2632    2806
Waiting:       76 2621 161.4   2632    2806
Total:         81 2622 161.1   2633    2807

Percentage of the requests served within a certain time (ms)
  50%   2633
  66%   2658
  75%   2673
  80%   2684
  90%   2710
  95%   2732
  98%   2759
  99%   2772
 100%   2807 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   269.309 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    37.13 [#/sec] (mean)
Time per request:       2693.094 [ms] (mean)
Time per request:       26.931 [ms] (mean, across all concurrent requests)
Transfer rate:          6.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      24
Processing:    81 2679 159.9   2693    2832
Waiting:       77 2679 159.9   2693    2832
Total:         81 2679 159.7   2693    2833

Percentage of the requests served within a certain time (ms)
  50%   2693
  66%   2710
  75%   2720
  80%   2727
  90%   2744
  95%   2759
  98%   2775
  99%   2786
 100%   2833 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   223.935 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    44.66 [#/sec] (mean)
Time per request:       2239.352 [ms] (mean)
Time per request:       22.394 [ms] (mean, across all concurrent requests)
Transfer rate:          7.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0      25
Processing:    81 2228 347.0   2015    2848
Waiting:       76 2228 346.9   2015    2847
Total:         81 2228 346.9   2016    2848

Percentage of the requests served within a certain time (ms)
  50%   2016
  66%   2517
  75%   2636
  80%   2668
  90%   2710
  95%   2736
  98%   2767
  99%   2789
 100%   2848 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   263.825 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    37.90 [#/sec] (mean)
Time per request:       2638.247 [ms] (mean)
Time per request:       26.382 [ms] (mean, across all concurrent requests)
Transfer rate:          6.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       7
Processing:    89 2624 160.4   2634    2971
Waiting:       84 2624 160.4   2634    2971
Total:         90 2624 160.1   2634    2971

Percentage of the requests served within a certain time (ms)
  50%   2634
  66%   2654
  75%   2667
  80%   2676
  90%   2697
  95%   2718
  98%   2760
  99%   2821
 100%   2971 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   263.422 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    37.96 [#/sec] (mean)
Time per request:       2634.223 [ms] (mean)
Time per request:       26.342 [ms] (mean, across all concurrent requests)
Transfer rate:          6.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0      33
Processing:    93 2620 156.0   2632    2794
Waiting:       90 2620 156.0   2632    2794
Total:         94 2621 155.7   2633    2798

Percentage of the requests served within a certain time (ms)
  50%   2633
  66%   2652
  75%   2663
  80%   2670
  90%   2691
  95%   2706
  98%   2724
  99%   2738
 100%   2798 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   262.554 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    38.09 [#/sec] (mean)
Time per request:       2625.539 [ms] (mean)
Time per request:       26.255 [ms] (mean, across all concurrent requests)
Transfer rate:          6.36 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0      15
Processing:    97 2612 156.8   2626    2782
Waiting:       87 2612 156.8   2625    2782
Total:         97 2612 156.2   2626    2783

Percentage of the requests served within a certain time (ms)
  50%   2626
  66%   2646
  75%   2658
  80%   2666
  90%   2686
  95%   2703
  98%   2721
  99%   2733
 100%   2783 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   262.993 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    38.02 [#/sec] (mean)
Time per request:       2629.931 [ms] (mean)
Time per request:       26.299 [ms] (mean, across all concurrent requests)
Transfer rate:          6.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       7
Processing:    81 2616 155.5   2631    2836
Waiting:       78 2616 155.5   2630    2836
Total:         82 2617 155.4   2631    2836

Percentage of the requests served within a certain time (ms)
  50%   2631
  66%   2648
  75%   2659
  80%   2666
  90%   2688
  95%   2708
  98%   2738
  99%   2759
 100%   2836 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.56.103 (be patient)


Server Software:        gunicorn
Server Hostname:        192.168.56.103
Server Port:            5004

Document Path:          /compute
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   263.116 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1710000 bytes
HTML transferred:       180000 bytes
Requests per second:    38.01 [#/sec] (mean)
Time per request:       2631.162 [ms] (mean)
Time per request:       26.312 [ms] (mean, across all concurrent requests)
Transfer rate:          6.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       9
Processing:    79 2617 153.7   2631    2802
Waiting:       75 2617 153.7   2631    2802
Total:         79 2617 153.4   2631    2804

Percentage of the requests served within a certain time (ms)
  50%   2631
  66%   2647
  75%   2657
  80%   2663
  90%   2678
  95%   2690
  98%   2704
  99%   2713
 100%   2804 (longest request)